from random import randint

chars = {0: ["Б", "В", "Г", "Д", "Ђ", "Ж", "З", "Ј", "К", "Л", "Љ", "М", "Н",
             "Њ", "П", "Р", "С", "Т", "Ћ", "Ф", "Х", "Ц", "Ч", "Џ", "Ш"] * 2 +
            ["Бл", "Бр", "Вл", "Вр", "Гл", "Гр", "Дл", "Др", "Жл", "Зл", "Зр",
             "Кр", "Кл", "Мр", "Мл", "Пј", "Пл", "Пљ", "Пњ", "Пр", "Св", "Сл",
             "См", "Сп", "Ст", "Тл", "Тр", "Фл", "Фљ", "Фњ", "Фр", "Хл", "Хр"],
         1: ["а", "е", "и", "о", "у", "р"],
         2: ["б", "в", "г", "д", "ђ", "ж", "з", "ј", "к", "л", "љ", "м", "н",
             "њ", "п", "р", "с", "т", "ћ", "ф", "х", "ц", "ч", "џ", "ш"],
         3: ["л", "р", "ј", "љ", "њ", "Ђ", "Ж", "Ј", "Л",
             "Љ", "Н", "Њ", "Р", "Ћ", "Ч", "Џ", "Ш"],
         4: [char for chars in ["а", ["е"] * 3, ["и"] * 4, ["о"] * 12]
             for char in chars]}


def lambda_handler(event, context):
    part = {0: chars[0][randint(0, len(chars[0]) - 1)],
            2: chars[2][randint(0, len(chars[2]) - 1)],
            3: chars[4][randint(0, len(chars[4])) - 1]}
    part[1] = chars[1][randint(0, len(chars[1]) -
                               (2 if part[0][-1] in chars[3] else 1))]

    return {"name": "".join([part[n] for n in sorted(part.keys())]) + "слав"}
